tap 'jorgelbg/tap'
tap 'facebook/fb'

cask_args appdir: '~/Applications'

cask 'vlc'
cask 'spotify'
cask 'alacritty'
cask 'telegram'
cask 'google-chrome'
cask 'obsidian'
cask 'figma'
cask 'visual-studio-code'
cask 'insomnia'
cask 'docker'
cask 'slack'
cask 'discord'
cask 'calibre'
cask 'cursor'
cask 'utm'
cask 'nrf-connect'
cask 'segger-jlink'
cask 'obs'
cask 'zulu@21'

# --- Shared across machine users

cask 'qbittorrent', args: { appdir: '/Applications' }
cask 'maintenance', args: { appdir: '/Applications' }

# --- Brews

brew 'nvm'
brew 'eza'
brew 'tmux'
brew 'nvim'
brew 'mas'
brew 'watchman'
brew 'rbenv'
brew 'ruby-build'
brew 'nmap'
brew 'ios-deploy'
brew 'htop'
brew 'flyctl'
brew 'zsh-autosuggestions'
brew 'fzf'
brew 'doctl'
brew 'gnupg'
brew 'facebook/fb/idb-companion'
brew 'apktool' # unzip and decompile android apk
brew 'jadx' # lool up inside android apk. jadx-gui available after installation

mas 'Xcode', id: 497799835
