tap 'homebrew/cask-versions'
tap 'jorgelbg/tap'

cask_args appdir: '~/Applications'

cask 'vlc'
cask 'spotify'
cask 'alacritty'
cask 'telegram'
cask 'protonvpn'
cask 'google-chrome'
cask 'obsidian'
cask 'figma'
cask 'visual-studio-code'
cask 'flipper'
cask 'deepl'
cask 'zulu11'
cask 'insomnia'
cask 'zoom'
cask 'docker'
cask 'slack'
cask 'discord'

# --- Shared across machine users

cask 'qbittorrent', args: { appdir: '/Applications' }
cask 'maintenance', args: { appdir: '/Applications' }

# --- Brews

brew 'nvm'
brew 'tmux'
brew 'nvim'
brew 'mas'
brew 'watchman'
brew 'rbenv'
brew 'ruby-build'
brew 'nmap'
brew 'yarn'
brew 'ios-deploy'
brew 'htop'
brew 'flyctl'
brew 'zsh-autosuggestions'
brew 'fzf'
brew 'doctl'
brew 'gnupg'

mas 'Xcode', id: 497799835
