tap 'jorgelbg/tap'
tap 'facebook/fb'
tap 'wix/brew'
tap 'anomalyco/tap'
tap 'mobile-dev-inc/tap'

cask_args appdir: '~/Applications'

cask 'vlc'
cask 'telegram'
cask 'obsidian'
cask 'figma'
cask 'insomnia'
cask 'google-chrome'
cask 'calibre'
cask 'chatgpt'
cask 'icon-composer'
cask 'font-0xproto-nerd-font'
cask 'ghostty'
cask 'obs'
cask 'pgadmin4'

# --- Shared across machine users

cask 'qbittorrent', args: { appdir: '/Applications' }
cask 'maintenance', args: { appdir: '/Applications' }

# --- Brews

brew 'nvm'
brew 'eza'
brew 'tmux'
brew 'nvim'
brew 'mas'
brew 'watchman'
brew 'rbenv'
brew 'pyenv'
brew 'jenv'
brew 'ruby-build'
brew 'nmap'
brew 'ios-deploy'
brew 'htop'
brew 'zsh-autosuggestions'
brew 'fzf'
brew 'gnupg'
brew 'facebook/fb/idb-companion'
brew 'httpie'
brew 'ipmitool'
brew 'scrcpy'
brew 'unar'
brew 'neofetch'
brew 'pnpm'
brew 'typewritten'
brew 'ripgrep'
brew 'fd'
brew 'unzip'
brew 'wix/brew/applesimutils'
brew 'anomalyco/tap/opencode'
brew 'wget'
brew 'luarocks'
brew 'tree-sitter-cli'
brew 'mobile-dev-inc/tap/maestro'

# mas 'Xcode', id: 497799835
